In [1]:
from _element import feature_control as ft_c

from _element import varr

import pandas as pd
import numpy as np

from datetime import datetime

import os, sys

path_name= os.getcwd()
sys.path.append(path_name)

In [2]:
path_name

'C:\\Nextop\\nextop-engine\\nextop_engine'

In [7]:
df_raw= ft_c.xlsx_opener(path_name+'\\_element\\data\\private\\', 'KPP일별투입(10_17).xlsx')

In [8]:
df_raw.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1300503 entries, 0 to 189668
Data columns (total 6 columns):
구분     1300503 non-null object
타입     1300503 non-null object
코드     1300503 non-null int64
발송일    1300503 non-null int64
유형     1300503 non-null int64
수량     1300503 non-null int64
dtypes: int64(4), object(2)
memory usage: 69.5+ MB

In [9]:
ft_c.colname(df_raw, {'발송일': 'ds', '수량': 'y'})

In [10]:
df_raw.head()

    구분        타입      코드        ds    유형   y
0  계약처  납품(직송포함)  298141  20100101  1815   8
1  계약처  납품(직송포함)  296285  20100101  1815  20
2  계약처  납품(직송포함)  295537  20100101  1815   4
3  계약처  납품(직송포함)  294932  20100101  1815  10
4  계약처  납품(직송포함)  294837  20100101  1815  10

In [11]:
df_raw= ft_c.struct(df_raw, 'ds', '유형', 'y')

In [12]:
df_raw.columns.name= None

In [13]:
df_raw.reset_index(drop= False, inplace= True)

In [14]:
df_raw['ds']= df_raw['ds'].apply(str).apply(lambda x: datetime(int(x[:4]),int(x[4:6]),int(x[6:])))

In [19]:
df_raw.head()

,ds,1025,1041,1057,1091,1111,1117,1119,1127,1163,...,1754,1797,1800,1815,1817,1852,1853,1878,1891,y_sum
0,2010-01-01,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,2652.0,0.0,0.0,0.0,0.0,0.0,2662.0
1,2010-01-02,192.0,6260.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,337.0,0.0,0.0,26443.0,0.0,0.0,459.0,626.0,0.0,39352.0
2,2010-01-03,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,404.0,0.0,0.0,0.0,0.0,0.0,404.0
3,2010-01-04,0.0,5141.0,0.0,320.0,0.0,0.0,0.0,0.0,0.0,...,154.0,576.0,0.0,22924.0,0.0,0.0,3445.0,3305.0,0.0,44906.0
4,2010-01-05,130.0,5494.0,0.0,1186.0,0.0,0.0,0.0,0.0,0.0,...,367.0,294.0,0.0,39081.0,320.0,0.0,3861.0,4362.0,238.0,69481.0

In [20]:
df_max7= df_raw.drop(['ds', 'y_sum'], axis=1)

In [21]:
df_idx= df_max7.sum(axis=0)

In [22]:
df_idx.sort_values(ascending=False)

1815    127126347.0
1692     26265973.0
1041     14508134.0
1853     14021594.0
1878     11706273.0
1261      6609168.0
1745      3855073.0
1627      3306558.0
1375      3276530.0
1373      1207720.0
1754      1044304.0
1355      1032345.0
1091       820050.0
1729       429062.0
1057       413512.0
1656       258699.0
1891       186852.0
1797       181591.0
1119       133825.0
1817       103189.0
1242        43550.0
1025        38105.0
1396        34635.0
1376        16476.0
1216        14701.0
1127         7481.0
1390         5000.0
1117         4500.0
1652         4500.0
1800         2155.0
1163         1760.0
1298         1000.0
1852          920.0
1111          360.0
dtype: float64

In [23]:
df_max7= df_max7.loc[:, np.where(df_idx>10000000, True, False)]

In [24]:
df_max7['ds']= df_raw['ds']

In [25]:
colname= df_max7.columns.tolist()

In [26]:
colname= colname[-1:]+colname[:-1]

In [27]:
df_max7= df_max7[colname]

In [28]:
df_max7.sum(axis=0)

1041     14508134.0
1692     26265973.0
1815    127126347.0
1853     14021594.0
1878     11706273.0
dtype: float64

In [29]:
df_max7.head()

          ds    1041    1692     1815    1853    1878
0 2010-01-01     0.0    10.0   2652.0     0.0     0.0
1 2010-01-02  6260.0  3422.0  26443.0   459.0   626.0
2 2010-01-03     0.0     0.0    404.0     0.0     0.0
3 2010-01-04  5141.0  3641.0  22924.0  3445.0  3305.0
4 2010-01-05  5494.0  6552.0  39081.0  3861.0  4362.0

In [31]:
ft_c.save_as_xlsx(path_name+'\\_element\\data\\private\\', df_max7, 'KPP일별투입(10_17).xlsx', '_withobject')